{
  "v2.5.17": {
    "features": {
      "1": "Removed deprecated options in menubar."
    }
  },
  "v2.5.16": {
    "features": {
      "1": "Added an issue log to view/manage issues and linked it to AWS."
    }
  },
  "v2.5.15": {
    "features": {
      "1": "Rearranged previous/next buttons, and removed them if only one page is available.",
      "2": "Adjusted sizing of plots and labels to work with new layout."
    },
    "other": {
      "1": "Added a Development AWS track."
    }
  },
  "v2.5.13": {
    "features": {
      "1": "Updated reader plots to be a 2x2 grid with 4 reader maximum"
    },
    "other": {
      "1": "Refactored GUI to be more modular"
    }
  },
  "v2.5.10": {
    "other": {
      "1": "Fixed post processing script"
    }
  },
  "v2.5.7": {
    "features": {
      "1": "Added a post-processing script to re-analyze data."
    }
  },
  "v2.5.6": {
    "features": {
      "1": "Now uploading summary csv instead of pdf",
      "2": "Experiment log is now uploaded in the experiment folder for the company.",
      "3": "Summary PDF now has experiment notes shown on the front page, rather than by the reader plots.",
      "4": "Summary PDF now places each readers plot on their own page."
    },
    "bugfixes": {
      "1": "App properly resets using new setup values. Introduced in v2.5.3",
      "2": "App properly handles equilibration time and SGI for multiple readers.",
      "3": "App properly handles the toggling between SGI and signal check."
    },
    "other": {
      "1": "Now properly parsing software update tags instead of relying on their order.",
      "2": "Inoculation was also updated to work with new experiment notes.",
      "3": "App properly handles software updates using new file structure."
    }
  },
  "v2.5.5": {
    "features": {
      "1": "Replaced `Cell Type` with `Experiment Id` on setup form"
    },
    "bugfixes": {
      "1": "Fixed software updated bug introduces in v2.5.3"
    },
    "other": {
      "1": "Updated guided setup to use an object rather than variables."
    }
  },
  "v2.5.4": {
    "features": {
      "1": "Reorganized file structure for data and backend files."
    }
  },
  "v2.5.3": {
    "other": "Major code refactor"
  },
  "v2.4.6": {
    "features": {
      "1": "Updated signal check to use percentages instead of values.",
      "2": "Added an indicator to check the state of a reader (errored, working, scanning)."
    }
  },
  "v2.4.5": {
    "features": {
      "1": "Updated default sweep frequency to 110-160 MHz",
      "2": "Closing guided setup now asks to close the app, rather than submitting the data.",
      "3": "Updated help dialog popup to only send the log to AWS, without placeholder text",
      "4": "Calibration now removes the first 0.2 MHz from the scan."
    }
  },
  "v2.4.4": {
    "features": {
      "1": "Added a button to download the analysis folder into a zip file."
    },
    "bugfixes": {
      "1": "Fixed bug causing end of experiment view to not show up."
    }
  },
  "v2.4.3": {
    "features": {
      "1": "Added a README.md file containing information about the files in the Analysis directory",
      "2": "Copied over second axis files into the Analysis directory.",
      "3": "Created instantaneous flip from SGI to signal check."
    },
    "bugfixes": {
      "1": "Gave the user the option of cancelling the port finding process to restart the app."
    }
  },
  "v2.4.2": {
    "bugfixes": {
      "1": "Ensured readers reconnect on the same port using their serial number."
    }
  },
  "v2.4.1": {
    "features": {
      "1": "Added support for setting equilibration period to 0.",
      "2": "Added back toggle to view signal check in ribbon.",
      "3": "Added Skroot copyright as app footer.",
      "4": "Added frequency and filename columns to smooth analyzed.",
      "5": "Created more specific error messages to display to user.."
    },
    "bugfixes": {
      "1": "Fixed sorting of the release notes dialog to accurately represent versioning."
    }
  }
}